In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [4]:
s1 = Series(np.random.random(4), index=["a","c","d","e"])
s2 = Series(np.random.random(5), index=["a","c","e","f","g"])
s1 + s2

a    0.844214
c    0.786403
d         NaN
e    1.521576
f         NaN
g         NaN
dtype: float64

In [10]:
frame1 = DataFrame(np.arange(9).reshape((3,3)), columns=list("bcd"), index=["Leeds","York","Otley"])
frame2 = DataFrame(np.arange(12).reshape((4,3)), columns=list("bde"), index=["Leeds","Elland","York","Otley"])
frame1

       b  c  d
Leeds  0  1  2
York   3  4  5
Otley  6  7  8

In [11]:
frame2

        b   d   e
Leeds   0   1   2
Elland  3   4   5
York    6   7   8
Otley   9  10  11

In [12]:
frame1 + frame2

           b   c     d   e
Elland   NaN NaN   NaN NaN
Leeds    0.0 NaN   3.0 NaN
Otley   15.0 NaN  18.0 NaN
York     9.0 NaN  12.0 NaN

In [13]:
frame1.add(frame2, fill_value=0)

           b    c     d     e
Elland   3.0  NaN   4.0   5.0
Leeds    0.0  1.0   3.0   2.0
Otley   15.0  7.0  18.0  11.0
York     9.0  4.0  12.0   8.0

## "Broadcasting" ##

In [16]:
frame2

        b   d   e
Leeds   0   1   2
Elland  3   4   5
York    6   7   8
Otley   9  10  11

In [21]:
series = Series(np.random.random(3), index=list("deb"))
series

d    0.985093
e    0.436587
b    0.093925
dtype: float64

In [22]:
frame2 - series

               b         d          e
Leeds  -0.093925  0.014907   1.563413
Elland  2.906075  3.014907   4.563413
York    5.906075  6.014907   7.563413
Otley   8.906075  9.014907  10.563413

In [23]:
series2 = Series(range(3), index=list("bef"))
frame2 + series2

          b   d     e   f
Leeds   0.0 NaN   3.0 NaN
Elland  3.0 NaN   6.0 NaN
York    6.0 NaN   9.0 NaN
Otley   9.0 NaN  12.0 NaN

In [24]:
series3 = frame2["d"]
series3

Leeds      1
Elland     4
York       7
Otley     10
Name: d, dtype: int32

In [25]:
frame2.div(series3, axis=0)

               b    d         e
Leeds   0.000000  1.0  2.000000
Elland  0.750000  1.0  1.250000
York    0.857143  1.0  1.142857
Otley   0.900000  1.0  1.100000

## Function applications ##

In [26]:
np.exp(frame2)

                  b             d             e
Leeds      1.000000      2.718282      7.389056
Elland    20.085537     54.598150    148.413159
York     403.428793   1096.633158   2980.957987
Otley   8103.083928  22026.465795  59874.141715

In [28]:
# I tend to agree with the style guide that _named_ function
# objects should not be lambdas
def spread(array):
    return array.max() - array.min()

frame2.apply(spread)

b    9
d    9
e    9
dtype: int64

In [29]:
frame2.apply(spread, axis=1)

Leeds     2
Elland    2
York      2
Otley     2
dtype: int64

In [30]:
frame2.mean()

b    4.5
d    5.5
e    6.5
dtype: float64

In [31]:
def ran(array):
    return Series([array.min(), array.max()], index=["min","max"])

frame2.apply(ran)

     b   d   e
min  0   1   2
max  9  10  11

In [39]:
def pretty(x):
    return "{:.2f}".format(x)

frame2.applymap(pretty)

           b      d      e
Leeds   0.00   1.00   2.00
Elland  3.00   4.00   5.00
York    6.00   7.00   8.00
Otley   9.00  10.00  11.00